diary/app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(params[:entry]) #it' s entry because of the magic.
    if @entry.save #if true
---
INSERT INTO "entries" ("body", "title") VALUES (?, ?)  [["body", "blah"], ["title", "blah"]]

  def update
    @entry = Entry.find(params[:id])
    if @entry.update_attributes(params[:entry])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "entries" SET "title" = 'Twice blah', "body" = 'Twice blah' WHERE "entries"."id" = 3