Rails_Project1/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "Hello all you amazing folks!"], ["created_at", Tue, 07 Jan 2014 21:15:43 UTC +00:00], ["updated_at", Tue, 07 Jan 2014 21:15:43 UTC +00:00]]
---
  def create
    @tweet = Tweet.new(params[:tweet])
    if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 3]]
---
  def destroy
    @tweet = Tweet.find(params[:id])
    @tweet.destroy